[{"name":"Dashboard","path":"/aws-solutions-architect-associate-notes","text":"","wordCount":0,"type":"TOC"},{"name":"Exam preparation path","description":"Exam preparation","topics":["preparation"],"path":"/aws-solutions-architect-associate-notes/exampreparation","text":"AWS Certification Exam Guide\nReview the exam guide, which contains the content outline and target audience for the certification exam. Perform a self-assessment to identify your knowledge or skills gaps.\n\nMy Preparation path\nGo through the ACloudGuru AWS certified solutions architect associate course [23.5 hrs]\nGo through the ACloudGuru AWS well architected framework () course [4.7 hrs*]\nGo through the ACloudGuru AWS RDS () course [3.1 hrs*]\nAttempt the practice tests by Neal Davis at Udemy. After each test, note down the concepts I had difficulties with.\nAttempt the practice tests by Jon Bonso at Udemy. Again, after each test, note down the concepts I had difficulties with.\n\nSo you should go through the notes only after you have done a course that explains the basics, such as the one from ACloudGuru.\n\n(*) This course is optionnal\n\nDeep dive\nThe following courses are by no means required to pass the AWS certification. They are listed to get a more in depth view about some AWS critical services.\nS3 master class course [10.7 hrs]\nIdentity and Access Management (IAM) Concepts course [1.5 hrs]\nHow to Properly Secure an S3 Bucket course [2.2 hrs]\nAWS Security Essentials course [11.2 hrs]\nLearn AWS by Doing course [19.5 hrs]\nBuilding a Full-Stack Serverless Application on AWS course [7.8 hrs]\nAmazon DynamoDB Deep Dive course [15.9 hrs]\n","wordCount":204,"type":"Content"},{"name":"Well-Architected Framework","description":"Well-Architected Framework","topics":["Well-Architected Framework"],"path":"/aws-solutions-architect-associate-notes/wellarchitectedframework","text":"The five pillars are:\nOperational Excellence\nSecurity\nReliability\nPerformance Efficiency\nCost Optimization\n\nOperational Excellence\nDesign Principles\nPerform operations as code\nAnnotate documents\nMake frequent, small, reversible changes\nRefine operations procedures frequently\nAnticipate failure\nLearn from all operational failures\nBest Practices\nPrepare\nOperate\nEvolve\n\nKey AWS Service\nAWS CloudFormation\n\nSecurity\nDesign Principles\nImplement a strong identity foundations\nEnable traceability\nApply security at all layers\nAutomate security best practices\nProtect data in transit and at rest\nKeep people away from data\nPrepare for security events\n\nBest Practices\nIdentity and Access Management\nDetective Controls\nInfrastructure Protection\nData Protection\nIncident Response\n\nKey AWS Service\nAWS Identity and Access Management (IAM)\n\nReliability\nDesign Principles\nTest recovery procedures\nAutomatically recover from failure\nScale horizontally to increase aggregate system availability\nStop guessing capacity\nManage change in automation\n\nBest Practices\nFoundations\nChange Management\nFailure Management\n\nKey AWS Service\nAmazon CloudWatch\n\nPerformance Efficiency\nDesign Principles\nDemocratize advanced technologies\nGo global in minutes\nUse serverless architecture\nExperiment more often\nMechanical sympathy\n\nBest Practices\nSelection\n  Compute\n  Storage\n  Database\n  Network\nReview\nMonitoring\nTradeoffs\n\nKey AWS Service\nAmazon CloudWatch\n\nCost Optimization\nDesign Principles\nAdopt a consumption model\nMeasure overall efficiency\nStop spending money on data center operations\nAnalyze and attribute expenditure\nUse managed and application level services to reduce cost of ownership\n\nBest Practices\nExpenditure Awareness\nCost-Effective Resources\nMatching Supply and Demand\nOptimizing Over Time\n\nKey AWS Service\nCost Explorer\n","wordCount":149,"type":"Content"},{"name":"White Papers & FAQs","description":"Read White Papers & FAQs","topics":["white papers","FAQs"],"path":"/aws-solutions-architect-associate-notes/whitepapers","text":"AWS Well-Architected and the Five Pillars\nFramework Overview\nOperational Excellence Pillar\nSecurity Pillar\nReliability Pillar\nPerformance Efficiency Pillar\nCost Optimization Pillar\n\nAWS Well-Architected Lenses\nLenses extend the guidance offered by AWS Well-Architected to specific industry and technology domains.\nServerless Applications Lens – AWS Well-Architected\n\nFAQs\nFocus on the following FAQs\nEC2\nS3\nVPC\nRoute 53\nRDS\nSQS\n\nTake a look a these FAQs\nIAM\nELB\nLambda\nEBS\nEFS\nAurora\nDynamodb\nElasticache\nCloudfront\nAPI gateway\nAutoscaling\nSNS","wordCount":46,"type":"Content"},{"name":"Security and Identity","description":"IAM, Resource Access Manager, Cognito, Secrets Manager, GuardDuty, Macie, KMS, Cloud HSM, Directory Service, WAF, Shield","topics":["security"],"path":"/aws-solutions-architect-associate-notes/securityandidentity","text":"","wordCount":0,"type":"TOC"},{"name":"IAM","description":"Manage access to AWS resources","topics":["security","iam"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/iam","text":"AWS Identity and Access Management (IAM) enables you to securely control access to AWS services and resources for your users.\n\nAllows for centralized control and shared access to your AWS Account and/or AWS services\nBy default when you create a user, they have NO permissions to do anything\nRoot account has full admin access upon account creation\nNot region specific, can be shared between all regions\nGranular permission sets for AWS resources\nIncludes Federation Integration which taps into Active Directory, Facebook, Linkedin, etc. for authentication (Identity Federation)\nMulti-factor authentication support\nAllows configuration of temporary access for users, devices and services\nSet up and manage password policy and password rotation policy for IAM users\nIntegration with many different AWS services\nSupports PCI DSS compliance (Payment Card Industry Data Security Standard)\nAccess can be applied to\n  Users - End users (people)\n  Groups - Collection of users under one set of permissions\n  Roles - Assigned to AWS resources. Example: specifying what the resource (such as EC2) is allowed to access on another resource (S3)\n  Policies - JSON Document that defines one or more permissions\nPolicies can be applied to users, groups and roles\nYou can assign up to 10 managed policies to a single group\nPolicy documents must have a version, and a statement in the body; The statement must consist of:\n  Effects (Allow, Deny),\n  Actions (Which action to allow/deny such a * for all actions), and\n  Resources (affected resources such as * for all resources)\nAll resources can share the same policy document\nThere are 3 different types of roles\n  Service Roles\n  Cross account access roles: Used when you have multiple AWS accounts and another AWS account must interact with the current AWS account.\n  Identity provider access roles: Roles for Facebook, Google or similar Identity providers.\nIn order for a new IAM user to be able to log into the console, the user must have a password set.\nBy default a new users access is only accomplished through the use of the access key/secret key\nIf the users password is a generated password, it also will only be shown at the time of creation.\nCustomizable Console Sign-in link can be configured on the main IAM page (ie aws.yourdomain.com)\nCustomizable Console Sign-in links must be globally unique. If a sign in link name is already taken, you must choose an alternative\nRoot account is email address that you used to register your account\nRecommended that root account:\n  should not be used for login\n  should be secured with Multi-factor Authentication (MFA)\nCan create Access Key ID & Secret Access Keys to allow IAM users (or service accounts) to be used with AWS CLI or API calls.\nAccess Key ID & Secret Access Keys are not the same as Username & Password and are not interchangeable.\n  Username & Password are used to login to console.\n  Access Key ID & Secret Access Keys are used for programmatic access (via the APIs or CLI)\nWhen creating a user's credentials, you can only see/download the credentials at the time of creation not after.\nAccess Keys can be retired, and new ones can be created in the event that secret access keys are lost.\nTo create a user password, once the users have been created, choose the user you want to set the password for and from the User Actions drop list, click manage password. Here you can opt to create a generated or custom password. If generated, there is an option to force the user to set a custom password on next login. Once a generated password has been issued, you can see the password which is the same as the access keys. Its shown once only.\nClick on Policies from the left side menu and choose the policies that you want to apply to your users. When you pick a policy that you want applied to a user, select the policy, and then from the top Policy Actions drop menu, choose attach and select the user that you want to assign the policy to.\n\nIAM ARNs\narn:partition:service:region:account:resource\n\nWhere:\npartition identifies the partition that the resource is in. For standard AWS Regions, the partition is aws. If you have resources in other partitions, the partition is aws-partitionname. For example, the partition for resources in the China (Beijing) Region is aws-cn. You cannot delegate access between accounts in different partitions.\nservice identifies the AWS product. For IAM resources, this is always iam.\nregion is the Region the resource resides in. For IAM resources, this is always kept blank.\naccount is the AWS account ID with no hyphens (for example, 123456789012).\nresource is the portion that identifies the specific resource by name.\n\n| Resource or Operation                                  | Default Limit |\n| ------------------------------------------------------ | ------------- |\n| Groups per account                                     | 100           |\n| Instance profiles                                      | 100           |\n| Roles                                                  | 250           |\n| Server Certificates                                    | 20            |\n| Users                                                  | 5000          |\n| Number of policies allowed to attach to a single group | 10            |\n\nCreate a group:\nimages/iam/iam1.png\n\nPolicy: json defined permissions\nimages/iam/iam2.png\n\nIAM roles are a secure way to grant permissions to entities that you trust.\nimages/iam/iam3.png","wordCount":799,"type":"Content"},{"name":"RAM","description":"Share AWS resources with other AWS accounts.","topics":["security","RAM"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/ram","text":"AWS Resource Access Manager (RAM) is a service that enables you to easily and securely share AWS resources with any AWS account or within your AWS Organization.\nYou can share the following resources with RAM:\n  AWS Transit Gateways,\n  Subnets,\n  AWS License Manager configurations,\n  Amazon Route 53 Resolver rules.\n\nMany organizations use multiple accounts to create administrative or billing isolation, and to limit the impact of errors. RAM eliminates the need to create duplicate resources in multiple accounts, reducing the operational overhead of managing those resources in every single account you own. You can create resources centrally in a multi-account environment, and use RAM to share those resources across accounts in 3 simple steps:\n\n1- create a Resource Share,\n2- specify resources,\n3- specify principals with whom to share. A principal can be:\n  AWS accounts,\n  organizational units (OU),\n  or an entire organization from AWS Organizations\n\nRAM is available to you at no additional charge (free).\n\nBenefits\nReduce Operational Overhead\nProcure AWS resources centrally, and use RAM to share resources such as subnets or License Manager configurations with other accounts. This eliminates the need to provision duplicate resources in every account in a multi-account environment, reducing the operational overhead of managing those resources in every account.\nImprove Security and Visibility\nRAM leverages existing policies and permissions set in AWS Identity and Access Management (IAM) to govern the consumption of shared resources. RAM also provides comprehensive visibility into shared resources to set alarms and visualize logs through integration with Amazon CloudWatch and AWS CloudTrail.\n\nOptimize Costs\nSharing resources such as AWS License Manager configurations across accounts allows you to leverage licenses in multiple parts of your company to increase utilization and optimize costs.\n\nHow it works?\nimages/ram/ram1.png","wordCount":268,"type":"Content"},{"name":"Cognito","description":"Authentication & Authorization for Web and mobile apps","topics":["security","Cognito","Web Identity Federation"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/cognito","text":"Amazon Cognito lets you easily add user sign-up and sign-in to your mobile and web apps.\nAmazon Cognito has two authentication methods, independent of one another\n  Sign in via third party federation\n  Cognito user pools\nyou have the options to authenticate users through social identity providers such as Facebook, Twitter, or Amazon, via SAML 2.0 identity solutions, or by using your own identity system.\nCan enable users to sign up or sign in with an email address or phone number.\nsupport SMS-based multi-factor authentication (MFA).\n\nUser Pools & Identity Pools\nUser Pools\nfor authentication purpose\nmanage sign-up sign-in functionality for mobile and web app\ncan sign-in directly (use email, password) or use Facebook, Amazon, Google\n\nIdentity Pools\nfor authorization purpose\nprovide temporary AWS credentials to access AWS services like S3 or DynamoDB\n\nimages/cognito/cognito1.png\n\nCognito Synchronisation\nAmazon Cognito enables you to save data locally on users devices, allowing your applications to work even when the devices are offline.\nYou can thencsynchronize data across user devices so that their app experience remains consistent regardless of the device they use.\nSave mobile data like game states or preferences.\nUse SNS to send notification to all devices associated with user identity whenever data stored in the cloud changes (email address change, password, setting in app... )\nimages/cognito/cognito2.png\n","wordCount":193,"type":"Content"},{"name":"Secrets Manager","description":"Easily rotate, manage, and retrieve secrets throughout their lifecycle","topics":["security","Secrets Manager"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/secretsmanager","text":"Protects secrets needed to access your applications, services, and IT resources.\nEnables you to easily rotate, manage, and retrieve:\n  database credentials,\n  API keys,\n  and other secrets throughout their lifecycle.\nUsers and applications retrieve secrets with a call to Secrets Manager APIs, eliminating the need to hardcode sensitive information in plain text.\nSecrets Manager offers secret rotation with built-in integration for:\n  Amazon RDS,\n  Amazon Redshift,\n  and Amazon DocumentDB.\nthe service is extensible to other types of secrets, including API keys and OAuth tokens.\nEnables you to control access to secrets using fine-grained permissions and audit secret rotation centrally for resources in the AWS Cloud, third-party services, and on-premises.\n\nHow it works?\nimages/secretsmanager/secretsmanager1.png","wordCount":103,"type":"Content"},{"name":"GuardDuty","description":"Intelligent threat detection to protect your AWS accounts and workloads","topics":["security","GuardDuty"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/guardduty","text":"Amazon GuardDuty is a continuous security monitoring service that analyzes and processes the following Data sources:\n  VPC Flow Logs,\n  CloudTrail management event logs,\n  Cloudtrail S3 data event logs,\n  DNS logs.\nIt uses threat intelligence feeds, such as lists of malicious IP addresses and domains, and machine learning to identify unexpected and potentially unauthorized and malicious activity within your AWS environment.\nThis can include issues like:\n  escalations of privileges,\n  uses of exposed credentials,\n  communication with malicious IP addresses, URLs, or domains.\nGuardDuty can detect compromised EC2 instances serving malware or mining bitcoin.\nIt also monitors AWS account access behavior for signs of compromise, such as unauthorized infrastructure deployments, like instances deployed in a Region that has never been used, or unusual API calls, like a password policy change to reduce password strength.\nGuardDuty informs you of the status of your AWS environment by producing security findings that you can view:\n  in the GuardDuty console\n  or through Amazon CloudWatch events.","wordCount":152,"type":"Content"},{"name":"Macie","description":"Discover and protect your sensitive data at scale","topics":["security","Macie"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/macie","text":"Macie automatically provides an inventory of Amazon S3 buckets including a list of:\n  unencrypted buckets,\n  publicly accessible buckets,\n  buckets shared with AWS accounts outside those you have defined in AWS Organizations.\nThen, Macie applies machine learning and pattern matching techniques to the buckets you select to identify and alert you to sensitive data, such as personally identifiable information (PII).\nMacie’s alerts, or findings, can be searched and filtered in the AWS Management Console and sent to Amazon CloudWatch Events for easy integration with existing workflow or event management systems, or to be used in combination with AWS services, such as AWS Step Functions to take automated remediation actions.\nHelp you meet regulations, such as the Health Insurance Portability and Accountability Act (HIPAA) and General Data Privacy Regulation (GDPR).\n\nHow it works?\nimages/macie/macie1.png","wordCount":126,"type":"Content"},{"name":"KMS","description":"Create keys and control encryption across AWS and beyond.","topics":["security","Kms"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/kms","text":"Overview\nKey management is the management of cryptographic keys within a cryptosystem. This includes dealing with the generation, exchange, storage, use, and replacement of keys.\n\nAWS offers two services that provide you with the ability to manage your own symmetric or asymmetric cryptographic keys:\nAWS KMS: A service enabling you to generate, store, enable/disable, and delete symmetric keys\nAWS CloudHSM: A service providing you with secure cryptographic key storage by making Hardware Security Modules (HSMs) available on the AWS cloud.\n\nFeatures\nManaged service that enables you to easily create and control the keys used for cryptographic operations.\nA shared key management infrastructure with FIPS 140–2 Level 2 compliance\nCurrently supports 50+ AWS services.\nA regional service\nHighly Available (HA). Keys are kept as multiple copies in a single region to make sure its durability and reliability.\nIt integrates fully with IAM and CloudTrail for Permission Management and Auditing respectively.\nSupports both symmetric and asymmetric key encryption. Until 2019, it only supported symmetric but now it supports both key encryption aspects With the support of asymmetric key encryption, it widened the aspect of interoperability by being able to connect to many other Key Management Infrastructures in the market.\nAWS KMS lets you create keys that can never be exported from the service and that can be used to encrypt and decrypt data based on policies you define.\nBy using AWS KMS, you gain more control over access to data you encrypt.\nYou can use the key management and cryptographic features directly in your applications or through AWS cloud services that are integrated with AWS KMS.\nWhether you are writing applications for AWS or using AWS cloud services, AWS KMS enables you to maintain control over who can use your keys and gain access to your encrypted data.\n\nEncryption comparaison\n|           | En/decrypt | Secret key - storage | Secret key - management | Server or Client Encryption |\n| --------- | ---------- | -------------------- | ----------------------- | --------------------------- |\n| SSE - S3  | S3         | S3                   | S3                      | Server                      |\n| SSE - C   | AWS        | Client               | Client                  | Server                      |\n| SSE - KMS | AWS        | AWS                  | AWS/Client              | Server                      |\n| CSE       | Client     | Client               | Client                  | Client                      |","wordCount":355,"type":"Content"},{"name":"Cloud HSM","description":"Protects keys on a on a FIPS 140-2 Level 3 validated hardware","topics":["security","CloudHSM"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/cloudhsm","text":"Overview\nThere are multiple cryptography services are offered by AWS.\nAWS Key Management Service (KMS)\nAWS Certificate Manager\nAWS Secrets Manager\nAWS Cloud HSM\n\nTheoretically, all above services are working as Hardware Security Modules (HSMs). Out of them, CloudHSM has given more control to you and you are basically responsible to manage it. All the others basically managed by AWS.\n\nFeatures\nThe Hardware Security Module (HSM) is a dedicated hardware security module under your exclusive control. That means you get the dedicated access to HSM appliances. Only you have access to your keys and operations on the keys.\nHSMs are located in AWS data centers and it is managed and monitored by AWS.\nHSMs are FIPS 140–2 Level 3 complied and handled inside your VPC, isolated from the rest of the network.\n","wordCount":122,"type":"Content"},{"name":"Directory Service","description":"Host and Manage Active Directory.","topics":["security","Directory Service"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/directoryservice","text":"AWS Directory Service is a managed service offering that provides directories that contain\ninformation about your organization, including users, groups, computers, and other\nresources.\n\nOverview\nYou can choose from 4 directory types:\nAWS Managed Microsoft AD (Active Directory)\nSimple AD\nAD Connector\nAmazon Cognito User Pools\n\nAWS Managed Microsoft AD\nAWS Managed Microsoft AD is highly-available: each directory is deployed across multiple AZs.\nMonitoring automatically detects and replaces domain controllers that fail.\nIn addition, data replication and automated daily snapshots are configured for you.\nThere is no software to install, and AWS handles all of the patching and software updates.\nYou can set up trust relationships with your existing Active Directory domains to extend those directories to AWS cloud services\n\nSimple AD\nSimple AD is compatible with Microsoft Active Directory (Microsoft AD)\npowered by Linux-Samba Active Directory\nSimple AD supports commonly used ActiveDirectory features such as:\n  user accounts, group memberships,\n  domain-joining Amazon EC2 instances running Linux and Microsoft Windows,\n  Kerberos-based Single Sign-On (SSO),\n  group policies\nSimple AD provides daily automated snapshots to enable point-in-time recovery.\nyou cannot set up trust relationships between Simple AD and other Active Directory domains\n\nAD Connector\nAD Connector is a proxy for redirecting directory requests to your on-premise Microsoft Active Directory without caching any information in the cloud.\nAfter setup, your users can use their existing corporate credentials to log on to AWS applications, such as\n  Amazon WorkSpaces,\n  Amazon WorkDocs,\n  or Amazon WorkMail.\nWith the proper IAM permissions, they can also access the AWS Management Console and manage AWS resources such as Amazon EC2 instances or Amazon S3 buckets.\nWith AD Connector, you continue to manage your Active Directory as usual. For example, adding new users, adding new groups, or updating passwords are all accomplished using standard directory administration tools with your on-premises directory.\n\nAmazon Cognito User Pools\nThis directory type will simply redirect you to Cognito.\n\nWhen to use each type?\nAWS Managed Microsoft AD\nThis Directory Service is your best choice if:\nyou have  >= 5,000 users\nand need a trust relationship set up between an AWS-hosted directory and your on-premises directories.\n\nSimple AD\nIn most cases, Simple AD is the least expensive option and your best choice if\nyou have <= 5,000 users\nand don’t need the more advanced Microsoft Active Directory features.\n\nAD Connector\nAD Connector is your best choice when you want to use your existing on-premises directory with AWS cloud services.","wordCount":363,"type":"Content"},{"name":"WAF","description":"Protect web applications from common web exploits","topics":["security","WAF","Firewall"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/waf","text":"AWS Web Application Firewall (WAF) monitors HTTP and HTTPS request that are forwarded to\n  CloudFront\n  ALB (Application Load Balancer)\n  or API Gateway\nWAF is an Application level firewall, sit in layer 7 in OSI model.\nThe resources are protected via rules such as\n  IP addresses,\n  country,\n  request headers,\n  request body,\n  query strings,\n  string from regex,\n  request length ,\n  SQL injection,\n  XSS\n  ..\nAws managed rules or custom rules can be used\n\nWhen a request matches a rule statements, the action can be:\n  allow\n  block\n  or count","wordCount":81,"type":"Content"},{"name":"Shield","description":"Managed DDoS protection service","topics":["security","Shield","DDos"],"path":"/aws-solutions-architect-associate-notes/securityandidentity/shield","text":"AWS provides two levels of protection against DDoS attacks:\n  AWS Shield Standard\n  AWS Shield Advanced.\n\nAWS Shield Standard is automatically included at no extra cost beyond what you already pay for AWS WAF and your other AWS services.\nFor added protection against DDoS attacks, AWS offers AWS Shield Advanced.\nAWS Shield Advanced provides expanded DDoS attack protection for\n  Amazon EC2 instances,\n  Elastic Load Balancing (ALB, NLB and CLB),\n  CloudFront,\n  Route 53 hosted zones.","wordCount":69,"type":"Content"},{"name":"Storage","description":"S3, EFS, FSX, Storage Gateway","topics":["storage"],"path":"/aws-solutions-architect-associate-notes/storage","text":"","wordCount":0,"type":"TOC"},{"name":"S3","description":"Store objects in cloud","topics":["storage","S3"],"path":"/aws-solutions-architect-associate-notes/storage/s3","text":"","wordCount":0,"type":"Content"},{"name":"EFS","description":"Managed file storage for EC2","topics":["storage","EFS"],"path":"/aws-solutions-architect-associate-notes/storage/efs","text":"","wordCount":0,"type":"Content"},{"name":"FSx","description":"Fully managed third-party file systems optimized for a variety of workloads","topics":["storage","FSx"],"path":"/aws-solutions-architect-associate-notes/storage/fsx","text":"","wordCount":0,"type":"Content"},{"name":"Storage Gateway","description":"Hybrid storage integration","topics":["storage","Storage Gateway"],"path":"/aws-solutions-architect-associate-notes/storage/storagegateway","text":"","wordCount":0,"type":"Content"},{"name":"Database","description":"RDS, DynamoDB, Redshift, Elasticache","topics":["database"],"path":"/aws-solutions-architect-associate-notes/database","text":"","wordCount":0,"type":"TOC"},{"name":"RDS","description":"Managed Relational Database Service","topics":["database","RDS"],"path":"/aws-solutions-architect-associate-notes/database/rds","text":"","wordCount":0,"type":"Content"},{"name":"DynamoDB","description":"Managed NoSQL database","topics":["database","DynamoDB"],"path":"/aws-solutions-architect-associate-notes/database/dynamodb","text":"","wordCount":0,"type":"Content"},{"name":"ElastiCache","description":"In-Memory Cache","topics":["database","ElastiCache"],"path":"/aws-solutions-architect-associate-notes/databaseelasticache","text":"","wordCount":0,"type":"Content"},{"name":"Compute","description":"EC2, Lambda, Elastic Beanstalk, ECS","topics":["compute"],"path":"/aws-solutions-architect-associate-notes/compute","text":"","wordCount":0,"type":"TOC"},{"name":"EC2","description":"Virtual servers in Cloud","topics":["Compute","EC2"],"path":"/aws-solutions-architect-associate-notes/compute/ec2","text":"","wordCount":0,"type":"Content"},{"name":"Lambda","description":"Run code without thinking about servers","topics":["Compute","Lambda"],"path":"/aws-solutions-architect-associate-notes/compute/lambda","text":"","wordCount":0,"type":"Content"},{"name":"Elastic Beanstalk","description":"Run and manage Web Apps","topics":["Compute","Elastic Beanstalk"],"path":"/aws-solutions-architect-associate-notes/compute/elasticbeanstalk","text":"","wordCount":0,"type":"Content"},{"name":"ECS","description":"Highly secure, reliable, and scalable way to run Docker containers","topics":["Compute","ECS"],"path":"/aws-solutions-architect-associate-notes/compute/ecs","text":"","wordCount":0,"type":"Content"},{"name":"Migration & Transfer","description":"DMS, DataSync, Snow","topics":["migration","transfert"],"path":"/aws-solutions-architect-associate-notes/migrationandtransfer","text":"","wordCount":0,"type":"TOC"},{"name":"DMS","description":"Managed Database Migration Service","topics":["migration","transfert","DMS"],"path":"/aws-solutions-architect-associate-notes/migrationandtransfer/dms","text":"","wordCount":0,"type":"Content"},{"name":"DataSync","description":"simplifies, automates, and accelerates moving data","topics":["migration","transfert","DataSync"],"path":"/aws-solutions-architect-associate-notes/migrationandtransfer/datasync","text":"","wordCount":0,"type":"Content"},{"name":"Snow","description":"Large Scale Data Transport","topics":["migration","transfert","Snow"],"path":"/aws-solutions-architect-associate-notes/migrationandtransfer/snow","text":"","wordCount":0,"type":"Content"},{"name":"Networking & Content Delivery","description":"VPC, CloudFront, Route 53, API Gateway, Direct Connect, Global Accelerator","topics":["networking","content delivery"],"path":"/aws-solutions-architect-associate-notes/networkingandcontentdelivery","text":"","wordCount":0,"type":"TOC"},{"name":"VPC","description":"Isolated Cloud Resources","topics":["networking","content delivery","VPC"],"path":"/aws-solutions-architect-associate-notes/networkingandcontentdelivery/vpc","text":"","wordCount":0,"type":"Content"},{"name":"CloudFront","description":"Global Content Delivery Network","topics":["networking","content delivery","CloudFront"],"path":"/aws-solutions-architect-associate-notes/networkingandcontentdelivery/cloudfront","text":"","wordCount":0,"type":"Content"},{"name":"Route 53","description":"Scalable DNS and Domain Name Registration","topics":["networking","content delivery","Route 53"],"path":"/aws-solutions-architect-associate-notes/networkingandcontentdelivery/route53","text":"","wordCount":0,"type":"Content"},{"name":"API Gateway","description":"Scalable DNS and Domain Name Registration","topics":["networking","content delivery","API Gateway"],"path":"/aws-solutions-architect-associate-notes/networkingandcontentdelivery/apigateway","text":"","wordCount":0,"type":"Content"},{"name":"Direct Connect","description":"Dedicated Network Connection to AWS","topics":["networking","content delivery","Direct Connect"],"path":"/aws-solutions-architect-associate-notes/networkingandcontentdelivery/directconnect","text":"","wordCount":0,"type":"Content"},{"name":"Global Accelerator","description":"Improve your application’s availability and performance using the AWS Global Network","topics":["networking","content delivery","Global Accelerator"],"path":"/aws-solutions-architect-associate-notes/networkingandcontentdelivery/globalaccelerator","text":"","wordCount":0,"type":"Content"},{"name":"Management & Governance","description":"AWS Organizations, Cloud watch, Cloud trail, AWS Auto Scaling, Parameter Store, CloudFormation, AWS Well-Architected Tool","topics":["management","gouvernance"],"path":"/aws-solutions-architect-associate-notes/managementandgovernance","text":"","wordCount":0,"type":"TOC"},{"name":"AWS Organizations","description":"Central governance and management across AWS accounts.","topics":["management","gouvernance","AWS Organizations"],"path":"/aws-solutions-architect-associate-notes/managementandgovernance/organizations","text":"","wordCount":0,"type":"Content"},{"name":"CloudWatch","description":"Monitor Resources and Applications.","topics":["management","gouvernance","CloudWatch"],"path":"/aws-solutions-architect-associate-notes/managementandgovernance/cloudwatch","text":"","wordCount":0,"type":"Content"},{"name":"CloudTrail","description":"Track User Activity and API Usage.","topics":["management","gouvernance","CloudTrail"],"path":"/aws-solutions-architect-associate-notes/managementandgovernance/cloudtrail","text":"","wordCount":0,"type":"Content"},{"name":"AWS Auto Scaling","description":"Quickly scale your entire application on AWS.","topics":["management","gouvernance","Auto Scaling"],"path":"/aws-solutions-architect-associate-notes/managementandgovernance/autoscaling","text":"","wordCount":0,"type":"Content"},{"name":"Systems Manager - Parameter Store","description":"Secrets and configuration data management.","topics":["management","gouvernance","Parameter Store"],"path":"/aws-solutions-architect-associate-notes/managementandgovernance/parameterstore","text":"","wordCount":0,"type":"Content"},{"name":"CloudFormation","description":"Infrastructure provisionning as Code.","topics":["management","gouvernance","CloudFormation"],"path":"/aws-solutions-architect-associate-notes/managementandgovernance/cloudformation","text":"","wordCount":0,"type":"Content"},{"name":"AWS Well-Architected Tool","description":"Learn best practices, measure, and improve your workloads.","topics":["management","gouvernance","Well-Architected Tool"],"path":"/aws-solutions-architect-associate-notes/managementandgovernance/wellarchitectedtool","text":"How it works\nimages/wellarchitectedtool/wellarchitectedtool1.png","wordCount":3,"type":"Content"},{"name":"Developer Tools","description":"X-Ray","topics":["developertools"],"path":"/aws-solutions-architect-associate-notes/developertools","text":"","wordCount":0,"type":"TOC"},{"name":"X-Ray","description":"Analyze and Debug Your Applications.","topics":["developertools","X-Ray"],"path":"/aws-solutions-architect-associate-notes/developertools/xray","text":"","wordCount":0,"type":"Content"},{"name":"Analytics","description":"Athena, Amazon Redshift, EMR, Kinesis, Data Pipeline","topics":["analytics"],"path":"/aws-solutions-architect-associate-notes/analytics","text":"","wordCount":0,"type":"TOC"},{"name":"Athena","description":"Query Data in S3 using SQL.","topics":["analytics","Athena"],"path":"/aws-solutions-architect-associate-notes/analytics/athena","text":"","wordCount":0,"type":"Content"},{"name":"Redshift","description":"Data Warehousing","topics":["analytics","Redshift"],"path":"/aws-solutions-architect-associate-notes/analytics/redshift","text":"","wordCount":0,"type":"Content"},{"name":"EMR","description":"Managed Hadoop Framework","topics":["analytics","EMR"],"path":"/aws-solutions-architect-associate-notes/analytics/emr","text":"","wordCount":0,"type":"Content"},{"name":"Kinesis","description":"Managed Hadoop Framework","topics":["analytics","Kinesis"],"path":"/aws-solutions-architect-associate-notes/analytics/kinesis","text":"","wordCount":0,"type":"Content"},{"name":"Data Pipeline","description":"Orchestration for Data-Driven Workflows","topics":["analytics","Data Pipeline"],"path":"/aws-solutions-architect-associate-notes/analytics/datapipeline","text":"","wordCount":0,"type":"Content"},{"name":"Application Integration","description":"SNS, SQS, SWF, Step Functions","topics":["application","integration"],"path":"/aws-solutions-architect-associate-notes/applicationintegration","text":"","wordCount":0,"type":"TOC"},{"name":"SNS","description":"Managed message topics for Pub/Sub","topics":["application","integration","SNS"],"path":"/aws-solutions-architect-associate-notes/applicationintegration/sns","text":"","wordCount":0,"type":"Content"},{"name":"SQS","description":"Managed Message Queues","topics":["application","integration","SQS"],"path":"/aws-solutions-architect-associate-notes/applicationintegration/sqs","text":"","wordCount":0,"type":"Content"},{"name":"SWF","description":"Workflow Service for Coordinating Application Components","topics":["application","integration","SWF"],"path":"/aws-solutions-architect-associate-notes/applicationintegration/swf","text":"","wordCount":0,"type":"Content"},{"name":"Step Functions","description":"Coordinate Distributed Applications","topics":["application","integration","Step Functions"],"path":"/aws-solutions-architect-associate-notes/applicationintegration/stepfunctions","text":"","wordCount":0,"type":"Content"},{"name":"End User Computing","description":"Desktop Workspaces","topics":["End User Computing"],"path":"/aws-solutions-architect-associate-notes/endusercomputing","text":"","wordCount":0,"type":"TOC"},{"name":"Desktop Workspaces","description":"Coordinate Distributed Applications","topics":["End User Computing","Desktop Workspaces"],"path":"/aws-solutions-architect-associate-notes/endusercomputing/desktopworkspaces","text":"","wordCount":0,"type":"Content"}]